nxp-mcuxpresso/mcux-soc-svd/KW47B42Z83/KW47B42Z83_cm33_core1.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>UART_PFU</name>
      <description>no description available</description>
      <groupName>UART_PFU</groupName>
      <baseAddress>0xA8004000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x52</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>Control</name>
          <description>&quot;</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Deflt_UART_Int_Sel</name>
              <description>Default UART Interrupt Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Deflt_RTS_Sel</name>
              <description>Default RTS Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TFL_RFL_Mon_Sel</name>
              <description>TFL RFL Monitor Select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Debug_Mon_Sel</name>
              <description>Debug Moniter Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Interrupt_Tx_Empty_Threshold</name>
          <description>&quot;</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Int_Tx_Empty_Thr</name>
              <description>Interrupt Tx Empty Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Interrupt_Rx_Empty_Threshold</name>
          <description>&quot;</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Int_Rx_Thr</name>
              <description>Interrupt Rx Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTS_Assert_Trigger</name>
          <description>&quot;</description>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Rx_RTS_Asrt_Thr</name>
              <description>Rx RTS Assert Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Rx_Deassert_Trigger</name>
          <description>&quot;</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Rx_RTS_Deasrt_Thr</name>
              <description>Rx RTS Deassert Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Interrupt_Event_Mask</name>
          <description>&quot;</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DW_APB_UART_Mask</name>
              <description>DW APB UART Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Int_Tx_Empty_Mask</name>
              <description>Interrupt Tx Empty Mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Int_Rx_Mask</name>
              <description>Interrupt Rx Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Interrupt_Status_Mask</name>
          <description>&quot;</description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DW_APB_UART_Int_Status_Mask</name>
              <description>DW APB UART Interrupt Status Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Int_Tx_Empty_Status_Mask</name>
              <description>Interrupt Tx Empty Status Mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Int_Rx_Status_Mask</name>
              <description>Interrupt Rx Status Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Interrupt_Reset_Selection</name>
          <description>&quot;</description>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>IRS</name>
              <description>Interrupt Reset Select Configures to ISR Bit Settings</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Interrupt_Status</name>
          <description>&quot;</description>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DW_APB_UART_Int</name>
              <description>DW_APB_UART_Int Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Int_Tx_Empty</name>
              <description>Interrupt Tx Empty</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Int_Rx</name>
              <description>Interrupt Rx</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIU_PFU_Status</name>
          <description>&quot;</description>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>RTS_n</name>
              <description>RTS_n Signal Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SIU_PFU_RTS_n</name>
              <description>SIU_PFU_RTS_n Signal Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIU_PFU_RFL</name>
          <description>&quot;</description>
          <addressOffset>0x28</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>RFL</name>
              <description>Receive FIFO Level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIU_PFU_TFL</name>
          <description>&quot;</description>
          <addressOffset>0x2C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TFL</name>
              <description>Transmit FIFO Level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIU_Count_Value_Low</name>
          <description>&quot;</description>
          <addressOffset>0x40</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xC</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SIU_Cnt_Val_Low</name>
              <description>Count Value Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIU_Count_Value_1</name>
          <description>&quot;</description>
          <addressOffset>0x44</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SIU_Cnt1</name>
              <description>Count Value Register 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIU_Count_Value_2</name>
          <description>&quot;</description>
          <addressOffset>0x48</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SIU_Cnt2</name>
              <description>Count Value Register 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIU_Count_Value_3</name>
          <description>&quot;</description>
          <addressOffset>0x4C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SIU_Cnt3</name>
              <description>Count Value Register 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIU_Misc</name>
          <description>&quot;</description>
          <addressOffset>0x50</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SIU_MISC0</name>
              <description>SIU Miscellaneous Bit[0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIU_MISC1</name>
              <description>SIU Miscellaneous Bit[1]</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIU_MISC2</name>
              <description>SIU Miscellaneous Bit[2]</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
