nxp-mcuxpresso/mcux-soc-svd/KW47B42Z83/KW47B42Z83_cm33_core1.xml
        <register>
          <name>CIU2_AHB2_SMU1_ACCESS_ADDR</name>
          <description>AHB2 to SMU1 Accessible Address</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ahb2_smu1_access_addr</name>
              <description>SMU1 Accessible Memory Address from AHB2 side</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_AHB2_SMU1_ACCESS_MASK</name>
          <description>AHB2 to SMU1 Accessible Mask</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ahb2_smu1_access_mask</name>
              <description>SMU1 Accessible Memory Mask from AHB2 side</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_CPU2_FABRIC_ARB_CTRL</name>
          <description>CPU2 fabric arbiter control</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x44A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dmem_brst_term_cnt</name>
              <description>00= terminate dmem immediate after current transactio finish 01= termiante dmem transaction after 4 burst 10= termiante dmem transaction after 8 burst 11 = terminate dmem transaction after 16 burst</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>imem_brst_term_cnt</name>
              <description>00= terminate imem immediate after current transactio finish 01= termiante imem transaction after 4 burst 10= termiante imem transaction after 8 burst 11 = terminate imem transaction after 16 burst</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dmem_noburstterm</name>
              <description>0= burst of dmem will be terminated as per [1:0] setting 1= burst of dmem will not be terminated</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dmem_priority</name>
              <description>00= Dcode has higher prioirty compared to Icode for DMEM acccess 01= Dcode has higher prioirty compared to Icode for DMEM acccess 10= Icode has higher prioirty compared to Dcode for DMEM acccess 11= Dcode has higher prioirty compared to Icode for DMEM acccess</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dmem_round_robin_en</name>
              <description>0= fixed priority for DMEM acess from Icode and Dcode 1= round robin priority for DMEM acess from Icode and Dcode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>imem_noburstterm</name>
              <description>0= burst of imem will be terminated as per [1:0] setting 1= burst of imem will not be terminated</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>imem_priority</name>
              <description>00 = Icode has higher prioirty compared to Icode for IMEM acccess 01= Dcode has higher prioirty compared to Icode for IMEM acccess 10= Icode has higher prioirty compared to Dcode for IMEM acccess 11= Dcode has higher prioirty compared to Icode for IMEM acccess</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>imem_round_robin_en</name>
              <description>0= fixed priority for IMEM acess from Icode and Dcode 1= round robin priority for IMEM acess from Icode and Dcode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_CPU2_ICODE_INV_ADDR_CTRL</name>
          <description>CPU2 Icode invalid address access control</description>
          <addressOffset>0x15C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>last2_inv_addr_slave_id</name>
              <description>Last2_inv_addr_Slave_ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>last_inv_addr_slave_id</name>
              <description>Last_inv_addr_Slave_ID</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>cur_inv_addr_slave_id</name>
              <description>Cur_inv_addr_Slave_ID</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>haddr_icod_sel</name>
              <description>There are 3 haddr which can be observed by selecting this:</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_CPU2_ICODE_INV_ADDR</name>
          <description>CPU2 Icode invalid address</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>haddr_inv_addr</name>
              <description>based on CIU_CPU2_ICODE_INV_ADDR_CTRL[31:30], the address status is obsrved in this register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_CPU2_DCODE_INV_ADDR_CTRL</name>
          <description>CPU2 Dcode invalid address access control</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>last2_inv_addr_slave_id</name>
              <description>Last2_inv_addr_Slave_ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>last_inv_addr_slave_id</name>
              <description>Last_inv_addr_Slave_ID</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>cur_inv_addr_slave_id</name>
              <description>Cur_inv_addr_Slave_ID</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>last2_inv_addr_master_id</name>
              <description>Last2_inv_addr_master_ID</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>last_inv_addr_master_id</name>
              <description>Last_inv_addr_master_ID</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>cur_inv_addr_master_id</name>
              <description>Cur_inv_addr_master_ID</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>haddr_icod_sel</name>
              <description>There are 3 haddr which can be observed by selecting this:</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_CPU2_DCODE_INV_ADDR</name>
          <description>CPU2 Dcode invalid address</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>haddr_inv_addr</name>
              <description>based on CIU_CPU2_DCODE_INV_ADDR_CTRL[31:30], the address status is obsrved in this register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_CPU_CPU2_CTRL</name>
          <description>CPU2 control register</description>
          <addressOffset>0x16C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>vinithi</name>
              <description>1= Boot form high address 0x0030_0000 (ROM) 0 = Boot from low address 0x0000_0000 (ITCM) By default CPU2 is out of reset and boot from ROM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_jtag_chain_bypass</name>
              <description>1 = Bypass the JTAG chain of CPU2 0 = The CPU2 remains in JTAG chain This bit is backup in case the CPU2 doesn't work on silicon</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_boot_imem_mux_en</name>
              <description>1 = IMEM mux control is on CPU2 side to download the code during boot 0 = The IMEM mux is on CPU2 side</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_boot_dmem_mux_en</name>
              <description>1 = DMEM mux control is on CPU2 side to download the code during boot 0 = The DMEM mux is on CPU2 side This bit is disconnected in NBU level, DMEM MUX will always on CPU2 side</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_dbg_ctrl</name>
              <description>cpu2 debug control</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu3_reset_int</name>
              <description>cpu2 fw resets cpu3(or cpu3 fw resets cpu2 if this register is used by cpu3)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dsr_wkup_in_use</name>
              <description>dsr wkup when dsr_wkup_in_use = 1'b1</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu1_reset_int</name>
              <description>cpu2 fw resets cpu1( or cpu3 fw resets cpu1 if this register is used by cpu3)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_BRF_CTRL</name>
          <description>BRF Control and Status</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x301</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ahb_slv_brf_ser_en</name>
              <description>When set to 1, BRF serial interface will be accessed thru AHB slave memory mapped from 0xA800A000 to 0xA8011FFF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sel_brf_to_ssu_dump_path</name>
              <description>When set to 0, select BRF to SSU dump path</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ciu_brf_ref1x_clk_ctrl_bypass_en</name>
              <description>0: brf ref 1x clock is controlled brf_clk_req 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ciu_brf_ref1x_clk_ctrl_bypass_val</name>
              <description>1. brf ref clk 1x is enabled</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_chip_rdy</name>
              <description>BRF Chip_Rdy Status</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_BRF_EXTRA_PORT</name>
          <description>BRF Extra Port Connection</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>soc_brf_extra</name>
              <description>SOC_BRF_EXTRA[3:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_BRF_ECO_CTRL</name>
          <description>BRF ECO Control</description>
          <addressOffset>0x17C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xAAAAAAAA</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>eco_bits</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_BTU_CTRL</name>
          <description>BTU Control and Status</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>btu_cipher_en</name>
              <description>Bluetooth Cipher Logic</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dbus_high_speed_sel</name>
              <description>Dbus High Speed Select Signal for Greater than 4 MHz</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_clk_sel</name>
              <description>Bluetooth sys Clock Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_ip_ser_sel</name>
              <description>bt_ip_ser_sel</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>btu_mc_wakeup</name>
              <description>BTU MC_Wakeup Status</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_BT_PS</name>
          <description>BT Clock Power Save</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bt_mclk_nco_mval</name>
              <description>BT_MCLK NCO Module Step Control (default 0x0)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_mclk_nco_en</name>
              <description>BT_MCLK_NCO logic to count</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_mclk_tbg_nco_sel</name>
              <description>BT_4M_PCM_CLK</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_mclk_from_soc_sel</name>
              <description>BT_MCLK</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_BT_PS2</name>
          <description>BT Clock Power Save 2</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bt_pcm_clk_nco_mval</name>
              <description>BT_PCM_CLK NCO Module Step Control (default 0x0)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_pcm_clk_nco_en</name>
              <description>BT_PCM_CLK_NCO logic to count</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_pcm_clk_tbg_nco_sel</name>
              <description>BT_4M_PCM_CLK</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_BT_REF_CTRL</name>
          <description>BT Ref Control</description>
          <addressOffset>0x18C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x100000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>nco_en</name>
              <description>Bluetooth Reference Clock NCO Enable information to APU.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>nco_sel</name>
              <description>Bluetooth Reference Clock NCO Select Value</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>nco_gen</name>
              <description>Bluetooth Reference Clock NCO Gen Value</description>
              <bitOffset>2</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_clk_nco_refclk_sel</name>
              <description>BT clk (bt sys clk) selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_BT_PS3</name>
          <description>BT Clock Power Save 3</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>btu_16m_clk_nco_step_ctrl</name>
              <description>BT_16M_CLK NCO Module Step Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>btu_16m_clk_nco_en</name>
              <description>BTU 16M Clock NCO Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>btu_16m_clk_nco_sel</name>
              <description>BTU 16M clock NCO Select Value</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>btu_clk_nco_mode</name>
              <description>BTU Clock source from ref clock (nco mode)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
