nxp-mcuxpresso/mcux-soc-svd/KW47B42Z83/KW47B42Z83_cm33_core1.xml
        <register>
          <name>BTU_RIF_ERR_INJ_RX_CTRL</name>
          <description>RIF Error Injection Rx Control</description>
          <addressOffset>0xC7E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Err_Rx_En</name>
              <description>Error Injection Logic for Rx Packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>disable all error injection logic for Rx packets by programming Err_Rx_Mode, nErr_Pkts_Rx, and etc. have no effect at all</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable error injection logic for Rx packets</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Err_Rx_Mode</name>
              <description>Error Injection for Rx Packets</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>inject error on nErr_Pkts_Rx number of Rx packets</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>inject error on all Rx packets continuously based on Err_Delay'_Rx timer selected in Frame Scheduler</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>nErr_Pkts_Rx</name>
              <description>Number of Rx Error Packets</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>corrupt infinite number of Rx packets</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>n/a</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>rx_acl_dma_crc_cor</name>
              <description>RX ACL DMA Error CRC Corruption Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_acl_aes_crc_cor</name>
              <description>RX SCO AES Error CRC Corruption Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_acl_dmem_crc_cor</name>
              <description>RX ACL DMEM Error CRC Corruption Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_esco_dma_crc_cor</name>
              <description>RX eSCO DMA Error CRC Corruption Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_esco_aes_crc_cor</name>
              <description>RX SCO AES Error CRC Corruption Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_esco_dmem_crc_cor</name>
              <description>RX eSCO DMEM Error CRC Corruption Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_crc_cor_en</name>
              <description>RX CRC corruption enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_DBUS_COR_CONFIG_CTRL</name>
          <description>RIF Correlator Configuration Control</description>
          <addressOffset>0xC82</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8800</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DBus_CorCfg_Wr_Delay</name>
              <description>Rx Mode dBus BRF Correlator Configuration Control Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Cor_Prem_Det_Gate_Syncwd_En_Ant</name>
              <description>Enable BRF to start syncword detection after preamble found for Ant Mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Cor_Prem_Det_Gate_Syncwd_En_Nike</name>
              <description>Enable BRF to start syncword detection after preamble found for Nike Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Cor_Prem_Det_Gate_Syncwd_En_Ble</name>
              <description>Enable BRF to start syncword detection after preamble found for BLE Mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Cor_Prem_Det_Gate_Syncwd_En_Bt</name>
              <description>Enable BRF to start syncword detection after preamble found for Bluetooth Mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBus_CorCfg_Wr_Enable</name>
              <description>Rx Mode dBus BRF Correlator Configuration Transaction Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BRF_COR_CONFIG_ADDR</name>
          <description>RIF BRF Correlator Configuration Address</description>
          <addressOffset>0xC84</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x203</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Rx_Cor_Cfg_Addr</name>
              <description>Radio Register Address for Correlator Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL</name>
          <description>RIF Syncword and Access Code Send Control</description>
          <addressOffset>0xC86</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DBus_Syncword_Wr_Delay</name>
              <description>dBus Syncword and Access Code Control Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBus_Syncword_Wr_Enable</name>
              <description>Rx Mode dBus Syncword and Access Code Transaction Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BRF_ACC_CODE_ONE_ADDR</name>
          <description>RIF BRF Access Code 1 Address</description>
          <addressOffset>0xC88</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xB</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Rx_Acc_Code_One_Addr</name>
              <description>Radio Register Address for First Access Code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BRF_ACC_CODE_TWO_ADDR</name>
          <description>RIF Access Code 2 Address</description>
          <addressOffset>0xC8A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x13</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Rx_Acc_Code_Two_Addr</name>
              <description>Radio Register Address for Second Access Code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BRF_RX_MODE_TYPE_ADDR</name>
          <description>RIF Register</description>
          <addressOffset>0xC8C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1B</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Rx_Mode_Type_Addr</name>
              <description>Radio Register Address for Rx Mode Type</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BRF_RX_PKT_PLD_LEN_ADDR</name>
          <description>RIF Register</description>
          <addressOffset>0xC8E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1C</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Rx_Pkt_Pld_Len_Addr</name>
              <description>Radio Register Address for Rx Packet Payload Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_RX_SYNC_PULSE_TIMER</name>
          <description>RIF BRF Rx Sync Pulse Timer</description>
          <addressOffset>0xC90</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1E14</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Rx_Hdr_Pulse_Timeout</name>
              <description>Rx Header Pulse Timeout</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Rx_Sync_Pulse_Timeout</name>
              <description>Rx Sync Pulse Timeout</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_RX_BTC_SAMP_PHASE_ADJ</name>
          <description>RIF Rx Sample Phase Adjustment</description>
          <addressOffset>0xC92</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>HDR_START_POS_ADJ</name>
              <description>Positive Phase Adjustment after Header starts Pulse</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HDR_START_NEG_ADJ</name>
              <description>Negative Phase Adjustment after Header starts Pulse</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_START_POS_ADJ</name>
              <description>Positive Phase Adjustment after Payload Sync starts Pulse</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_START_NEG_ADJ</name>
              <description>Negative Phase Adjustment after Header Starts Pulse</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_RX_BLE_SAMP_PHASE_ADJ</name>
          <description>RIF Rx Sample Phase Adjustment</description>
          <addressOffset>0xC94</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PDU_START_POS_ADJ</name>
              <description>Positive Phase Adjustment after PDU Data starts Pulse</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDU_START_NEG_ADJ</name>
              <description>Negative Phase Adjustment after PDU Data starts Pulse</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFE_1M_PHASE_POS_ADJ</name>
              <description>Positive Phase Adjustment for DFE I/Q Samples After CRC</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFE_1M_PHASE_NEG_ADJ</name>
              <description>Negative Phase Adjustment for DFE I/Q Samples After CRC</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFE_2M_PHASE_POS_ADJ</name>
              <description>Positive Phase Adjustment for DFE I/Q Samples After CRC</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFE_2M_PHASE_NEG_ADJ</name>
              <description>Negative Phase Adjustment for DFE I/Q Samples After CRC</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_RX_TONE_CANCEL_CTRL</name>
          <description>Rx Tone Cancellation Control</description>
          <addressOffset>0xC96</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>RX_DBUS_PULL_IN_TIME</name>
              <description>Rx dBUS events pull-in time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BTC_PULL_IN_EN</name>
              <description>BTC dBUS events pull-in enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLE_PULL_IN_EN</name>
              <description>BLE dBUS events pull-in enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_RX_TONE_CANCEL_CHNL10</name>
          <description>Rx Tone Cancellation Channel</description>
          <addressOffset>0xC98</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x7F7F</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TONE_CANCEL_CHNL0</name>
              <description>Rx Tone Cancellation Channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TONE_CANCEL_CHNL1</name>
              <description>Rx Tone Cancellation Channel 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_RX_TONE_CANCEL_CHNL32</name>
          <description>Rx Tone Cancellation Channel</description>
          <addressOffset>0xC9A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x7F7F</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TONE_CANCEL_CHNL2</name>
              <description>Rx Tone Cancellation Channel 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TONE_CANCEL_CHNL3</name>
              <description>Rx Tone Cancellation Channel 3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BLE_CTL</name>
          <description>BLE RIF Control</description>
          <addressOffset>0xCA0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x20</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_brf_pu</name>
              <description>BLE BRF Power up</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ble_pll_req</name>
              <description>BLE PLL Clock Request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>data_loopback_en</name>
              <description>BLE Loopback Data Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>Rx data is from BRF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>Rx data is from Tx block</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>rx_iq_sample_phase</name>
              <description>BLE Rx IQ Sampling Rate Phase</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_freq_nr</name>
              <description>BLE Frequency Channel</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
