nxp-mcuxpresso/mcux-soc-svd/KW47B42Z83/KW47B42Z83_cm33_core1.xml
        <register>
          <name>DMA_CTRL</name>
          <description>TRANSCEIVER DMA CONTROL</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA_PAGE</name>
              <description>Transceiver DMA Page Selector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_PAGE_0</name>
                  <description>DMA idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_PAGE_1</name>
                  <description>RXDIG-IQ: Select from (mixer, decimator, pd channel filter, src, cfo-mixer, demod chan filter) in RXDIG. 11bit signed data, MSB aligned</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_PAGE_2</name>
                  <description>RXDIG-IQ-ALT: Same as above + signals on unused LSBs : {antenna switch, GenLL or 802.15.4LL CRC_FAIL} on &quot;Q&quot; LSBs, {preamble_found, aa_sfd_matched} on &quot;I&quot; LSBs.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_PAGE_3</name>
                  <description>ADC-IQ: 11bit samples are MSB aligned in each 16bit half-word</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_PAGE_4</name>
                  <description>PHASE: Select from (sync phase, demod phase) within RXDIG. MSB aligned</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_PAGE_5</name>
                  <description>RSSI-PHASE: select from 8bit Narrowband (rssi, rssi raw, lqi, snr, noise) and Wideband(rssi, rssi raw) + 8bit high-resolution PHASE</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_PAGE_6</name>
                  <description>MAG-PHASE: RSSI magnitude + 8bit high-resolution PHASE</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_PAGE_7</name>
                  <description>GEN4-PHY</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_PAGE_8</name>
                  <description>DETERMINISTIC</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_START_TRG</name>
              <description>DMA Start Trigger Selector</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_START_TRG_0</name>
                  <description>no trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_START_TRG_1</name>
                  <description>PHY: pd found</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_START_TRG_2</name>
                  <description>PHY: aa found</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_START_TRG_5</name>
                  <description>RXDIG: agc_gain_chg</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_START_TRG_6</name>
                  <description>TSM: rx_dig_en</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_START_TRG_7</name>
                  <description>TSM: tsm_irq0_start_trig</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_START_TRG_8</name>
                  <description>CRC pass</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_START_TRG_9</name>
                  <description>CRC done</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_START_TRG_10</name>
                  <description>Localization control: pattern match</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_START_TRG_11</name>
                  <description>GenericLL: cte_present, Bluetooth LE: cte_en</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_START_TRG_12</name>
                  <description>Ranging sequence manager: dma_trigger</description>
                  <value>0xC</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_START_EDGE</name>
              <description>DMA Start Trigger Edge Selector</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_START_EDGE_0</name>
                  <description>Trigger fires on a rising edge of the selected trigger source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_START_EDGE_1</name>
                  <description>Trigger fires on a falling edge of the selected trigger source</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_DEC</name>
              <description>DMA Decimation Rate</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_DEC_0</name>
                  <description>Data is captured on every data valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_DEC_1</name>
                  <description>Data is captured on every 2nd data valid</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_DEC_2</name>
                  <description>Data is captured on every 4th data valid</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_DEC_3</name>
                  <description>Data is captured on every 8th data valid</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_START_DLY</name>
              <description>DMA Start Trigger Delay</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_EN</name>
              <description>DMA Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_AA_TRIGGERED</name>
              <description>DMA Access Address triggered</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_START_TRIGGERED</name>
              <description>DMA Start Trigger Occurred</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_SIGNAL_VALID_MASK_EN</name>
              <description>DMA Signal Valid Mask Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_SIGNAL_VALID_MASK_EN_0</name>
                  <description>Disable use of dma_signal_valid_mask.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_SIGNAL_VALID_MASK_EN_1</name>
                  <description>Enable use of dma_signal_valid_mask.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
