nxp-mcuxpresso/mcux-soc-svd/KW47B42Z83/KW47B42Z83_cm33_core1.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="LPTMR2">
      <name>LPTMR0</name>
      <description>LPTMR</description>
      <groupName>LPTMR</groupName>
      <baseAddress>0xA91AD000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="LPTMR2">
      <name>LPTMR1</name>
      <description>LPTMR</description>
      <groupName>LPTMR</groupName>
      <baseAddress>0xA91AE000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>AXBS0</name>
      <description>AXBS</description>
      <groupName>AXBS</groupName>
      <baseAddress>0xA9180000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE04</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PRS0</name>
          <description>Priority Target Registers</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6543210</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M0</name>
              <description>Initiator 0 Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>target_port_1</name>
                  <description>This initiator has level 1 or highest priority when accessing the target port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_2</name>
                  <description>This initiator has level 2 priority when accessing the target port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_3</name>
                  <description>This initiator has level 3 priority when accessing the target port.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_4</name>
                  <description>This initiator has level 4 priority when accessing the target port.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_5</name>
                  <description>This initiator has level 5 priority when accessing the target port.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_6</name>
                  <description>This initiator has level 6 priority when accessing the target port.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_7</name>
                  <description>This initiator has level 7 priority when accessing the target port.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_8</name>
                  <description>This initiator has level 8 or the lowest priority when accessing the target port.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M1</name>
              <description>Initiator 1 Priority</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>target_port_1</name>
                  <description>This initiator has level 1 or highest priority when accessing the target port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_2</name>
                  <description>This initiator has level 2 priority when accessing the target port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_3</name>
                  <description>This initiator has level 3 priority when accessing the target port.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_4</name>
                  <description>This initiator has level 4 priority when accessing the target port.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_5</name>
                  <description>This initiator has level 5 priority when accessing the target port.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_6</name>
                  <description>This initiator has level 6 priority when accessing the target port.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_7</name>
                  <description>This initiator has level 7 priority when accessing the target port.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_8</name>
                  <description>This initiator has level 8 or lowest priority when accessing the target port.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M2</name>
              <description>Initiator 2 Priority</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>target_port_1</name>
                  <description>This initiator has level 1 or highest priority when accessing the target port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_2</name>
                  <description>This initiator has level 2 priority when accessing the target port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_3</name>
                  <description>This initiator has level 3 priority when accessing the target port.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_4</name>
                  <description>This initiator has level 4 priority when accessing the target port.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_5</name>
                  <description>This initiator has level 5 priority when accessing the target port.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_6</name>
                  <description>This initiator has level 6 priority when accessing the target port.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_7</name>
                  <description>This initiator has level 7 priority when accessing the target port.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_8</name>
                  <description>This initiator has level 8the or lowest priority when accessing the target port.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M3</name>
              <description>Initiator 3 Priority</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>target_port_1</name>
                  <description>This initiator has level 1 or highest priority when accessing the target port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_2</name>
                  <description>This initiator has level 2 priority when accessing the target port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_3</name>
                  <description>This initiator has level 3 priority when accessing the target port.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_4</name>
                  <description>This initiator has level 4 priority when accessing the target port.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_5</name>
                  <description>This initiator has level 5 priority when accessing the target port.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_6</name>
                  <description>This initiator has level 6 priority when accessing the target port.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_7</name>
                  <description>This initiator has level 7 priority when accessing the target port.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_8</name>
                  <description>This initiator has level 8the or lowest priority when accessing the target port.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M4</name>
              <description>Initiator 4 Priority</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>target_port_1</name>
                  <description>This initiator has level 1 or highest priority when accessing the target port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_2</name>
                  <description>This initiator has level 2 priority when accessing the target port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_3</name>
                  <description>This initiator has level 3 priority when accessing the target port.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_4</name>
                  <description>This initiator has level 4 priority when accessing the target port.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_5</name>
                  <description>This initiator has level 5 priority when accessing the target port.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_6</name>
                  <description>This initiator has level 6 priority when accessing the target port.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_7</name>
                  <description>This initiator has level 7 priority when accessing the target port.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_8</name>
                  <description>This initiator has level 8 or lowest priority when accessing the target port.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M5</name>
              <description>Initiator 5 Priority</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>target_port_1</name>
                  <description>This initiator has level 1 or highest priority when accessing the target port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_2</name>
                  <description>This initiator has level 2 priority when accessing the target port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_3</name>
                  <description>This initiator has level 3 priority when accessing the target port.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_4</name>
                  <description>This initiator has level 4 priority when accessing the target port.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_5</name>
                  <description>This initiator has level 5 priority when accessing the target port.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_6</name>
                  <description>This initiator has level 6 priority when accessing the target port.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_7</name>
                  <description>This initiator has level 7 priority when accessing the target port.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_8</name>
                  <description>This initiator has level 8 or lowest priority when accessing the target port.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M6</name>
              <description>Initiator 6 Priority</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>target_port_1</name>
                  <description>This initiator has level 1 or highest priority when accessing the target port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_2</name>
                  <description>This initiator has level 2 priority when accessing the target port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_3</name>
                  <description>This initiator has level 3 priority when accessing the target port.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_4</name>
                  <description>This initiator has level 4 priority when accessing the target port.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_5</name>
                  <description>This initiator has level 5 priority when accessing the target port.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_6</name>
                  <description>This initiator has level 6 priority when accessing the target port.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_7</name>
                  <description>This initiator has level 7 priority when accessing the target port.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port_8</name>
                  <description>This initiator has level 8the or lowest priority when accessing the target port.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
