nxp-mcuxpresso/mcux-soc-svd/KW47B42Z83/KW47B42Z83_cm33_core1.xml
        <register>
          <name>OCMDR2</name>
          <description>On-Chip Memory Descriptor Register</description>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OCMCF0</name>
              <description>OCMEM Control Field 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RO</name>
              <description>Read-Only</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Writes to the OCMDRn[11:0] are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Writes to the OCMDRn[11:0] are ignored</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OCMDR3</name>
          <description>On-Chip Memory Descriptor Register</description>
          <addressOffset>0x40C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OCMCF0</name>
              <description>OCMEM Control Field 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RO</name>
              <description>Read-Only</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Writes to the OCMDRn[11:0] are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Writes to the OCMDRn[11:0] are ignored</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OCMDR5</name>
          <description>On-Chip Memory Descriptor Register</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OCMCF0</name>
              <description>OCMEM Control Field 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RO</name>
              <description>Read-Only</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Writes to the OCMDRn[11:0] are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Writes to the OCMDRn[11:0] are ignored</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OCMECR</name>
          <description>On-Chip Memory ECC Control Register</description>
          <addressOffset>0x480</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENCR</name>
              <description>Enable RAM ECC Non-correctable Reporting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Non-correctable reporting disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Non-correctable reporting enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>E1BR</name>
              <description>Enable RAM ECC 1 Bit Reporting</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disable</name>
                  <description>1-bit reporting disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable</name>
                  <description>1-bit reporting enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OCMEIR</name>
          <description>On-Chip Memory ECC Interrupt Register</description>
          <addressOffset>0x488</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENCERRN</name>
              <description>ECC Non-correctable Error OCRAMn</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>E1BERRN</name>
              <description>ECC 1-bit Error OCRAMn</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>EELOC</name>
              <description>ECC Error Location</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>non_correctable_ocram0</name>
                  <description>non-correctable on OCRAM0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>non_correctable_ocram1</name>
                  <description>non-correctable on OCRAM1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>non_correctable_ocram2</name>
                  <description>non-correctable on OCRAM2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>non_correctable_ocram3</name>
                  <description>non-correctable on OCRAM3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>non_correctable_ocram4</name>
                  <description>non-correctable on OCRAM4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>non_correctable_ocram5</name>
                  <description>non-correctable on OCRAM5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>non_correctable_ocram6</name>
                  <description>non-correctable on OCRAM6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>non_correctable_ocram7</name>
                  <description>non-correctable on OCRAM7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>correctable_ocram0</name>
                  <description>1-bit correctable on OCRAM0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>correctable_ocram1</name>
                  <description>1-bit correctable on OCRAM1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>correctable_ocram2</name>
                  <description>1-bit correctable on OCRAM2</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>correctable_ocram3</name>
                  <description>1-bit correctable on OCRAM3</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>correctable_ocram4</name>
                  <description>1-bit correctable on OCRAM4</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>correctable_ocram5</name>
                  <description>1-bit correctable on OCRAM5</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>correctable_ocram6</name>
                  <description>1-bit correctable on OCRAM6</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>correctable_ocram7</name>
                  <description>1-bit correctable on OCRAM7</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALID</name>
              <description>Valid ECC Error Location field</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_valid</name>
                  <description>ECC Error Location field is not valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>valid</name>
                  <description>ECC Error Location field is valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OCMFAR</name>
          <description>On-Chip Memory Fault Address Register</description>
          <addressOffset>0x490</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EFADD</name>
              <description>ECC Fault Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCMFTR</name>
          <description>On-Chip Memory Fault Attribute Register</description>
          <addressOffset>0x494</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EFPRT</name>
              <description>On-Chip Memory ECC Fault Protection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EFMS</name>
              <description>On-Chip Memory ECC Fault Master Size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>size_8bit</name>
                  <description>8-bit size</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size_16bit</name>
                  <description>16-bit size</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size_32bit</name>
                  <description>32-bit size</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size_64bit</name>
                  <description>64-bit size</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EFW</name>
              <description>On-Chip Memory ECC Fault Write</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_write_bus_cycle</name>
                  <description>Last captured ECC event was not a write bus cycle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>write_bus_cycle</name>
                  <description>Last captured ECC event was a write bus cycle</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EFMST</name>
              <description>On-Chip Memory ECC Fault Master Number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EFSYN</name>
              <description>On-Chip Memory ECC Fault Syndrome</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCMFDRH</name>
          <description>On-Chip Memory ECC Fault Data High Register</description>
          <addressOffset>0x498</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EFDH</name>
              <description>On-Chip Memory ECC Fault Data High</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCMFDRL</name>
          <description>On-Chip Memory ECC Fault Data Low Register</description>
          <addressOffset>0x49C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EFDL</name>
              <description>On-Chip Memory ECC Fault Data Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPCR</name>
          <description>Core Platform Control Register</description>
          <addressOffset>0xC00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AXBS0_RREN</name>
              <description>AXBS0 Round Robin Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>AXBS0 in fixed priority arbitration mode at reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>AXBS0 in round robin arbitration mode at reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
